# -*- mode: org; org-confirm-babel-evaluate: nil; org-babel-noweb-wrap-start: "«"; org-babel-noweb-wrap-end: "»"; -*-

#+TITLE: Title-Goes-Here

** Generate PACS Latex Code

#+NAME: epj-pacs-codes-latex
#+BEGIN_SRC elisp  :var pacs_codes=pacs-codes-table :results latex replace :var join_delim="   \\and\n"
  (string-join (mapcar (lambda (x) (format "      {%s}{%s}" (car x) (nth 1 x))) pacs_codes) join_delim)
#+END_SRC

#+RESULTS: epj-pacs-codes-latex
#+BEGIN_EXPORT latex
      {PACS-key01}{text discribing PACS-key01}   \and
      {PACS-key02}{text discribing PACS-key02}
#+END_EXPORT

